package com.sec.mp.myapplication.entity;

/**
 * Created by Administrator on 2017/3/10.
 */

public class SongLrc {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"ret_code":0,"lyric":"[ti&#58;就算没有如果&#32;&#40;《三生三世十里桃花》电视剧插曲&#41;]&#10;[ar&#58;香香]&#10;[al&#58;就算没有如果]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;01]就算没有如果&#32;&#40;《三生三世十里桃花》电视剧插曲&#41;&#32;&#45;&#32;香香&#10;[00&#58;01&#46;33]词：栾杰&#10;[00&#58;01&#46;46]曲：谭旋&#10;[00&#58;01&#46;59]编曲：可可&#10;[00&#58;02&#46;44]&#10;[00&#58;31&#46;16]与你梦般的邂逅&#10;[00&#58;33&#46;54]&#10;[00&#58;34&#46;64]让我忘了所有&#10;[00&#58;38&#46;26]那一刻&#10;[00&#58;40&#46;99]你是否也心动&#10;[00&#58;44&#46;15]&#10;[00&#58;45&#46;51]情窦的朦胧&#10;[00&#58;48&#46;24]&#10;[00&#58;48&#46;80]凝结在心魄&#10;[00&#58;52&#46;03]&#10;[00&#58;52&#46;87]轮回中&#32;辗转为你执着&#10;[00&#58;59&#46;23]&#10;[01&#58;00&#46;17]我看见你在等我&#10;[01&#58;03&#46;15]&#10;[01&#58;03&#46;84]流光溢彩的灯火&#10;[01&#58;07&#46;47]你笑了&#10;[01&#58;08&#46;94]&#10;[01&#58;10&#46;02]繁华一时无色&#10;[01&#58;13&#46;97]&#10;[01&#58;14&#46;70]你给我的感动延续前世的梦&#10;[01&#58;21&#46;48]就算短暂也为你守候&#10;[01&#58;27&#46;83]&#10;[01&#58;29&#46;15]就算没有如果&#10;[01&#58;32&#46;22]&#10;[01&#58;32&#46;80]你会忘记了我&#10;[01&#58;35&#46;82]&#10;[01&#58;36&#46;33]也甘愿被爱蛊惑的热燃烧着的我&#10;[01&#58;43&#46;03]&#10;[01&#58;43&#46;63]就算没有如果&#10;[01&#58;46&#46;23]&#10;[01&#58;47&#46;37]真心无法诉说&#10;[01&#58;50&#46;36]&#10;[01&#58;50&#46;96]那思念也会缀满月色融进泪的温热&#10;[01&#58;58&#46;33]爱上你那一刻&#10;[02&#58;00&#46;89]&#10;[02&#58;02&#46;23]也许没有结果&#10;[02&#58;04&#46;44]&#10;[02&#58;04&#46;99]我也无怨无悔的为你执着&#10;[02&#58;16&#46;00]&#10;[02&#58;28&#46;00]我喜欢你好久了&#10;[02&#58;30&#46;00]&#10;[02&#58;31&#46;00]从相遇的那一刻&#10;[02&#58;34&#46;65]尘缘中&#10;[02&#58;36&#46;01]&#10;[02&#58;37&#46;38]好想时光停留&#10;[02&#58;40&#46;49]&#10;[02&#58;41&#46;87]那离别的伤痛像箭刺在心口&#10;[02&#58;47&#46;17]&#10;[02&#58;48&#46;81]回忆中泪湿透了清风&#10;[02&#58;53&#46;99]&#10;[02&#58;56&#46;49]就算没有如果&#10;[02&#58;59&#46;31]&#10;[03&#58;00&#46;09]你会忘记了我&#10;[03&#58;03&#46;04]&#10;[03&#58;03&#46;70]也甘愿被爱蛊惑的热燃烧着的我&#10;[03&#58;10&#46;13]&#10;[03&#58;10&#46;99]心动的那一刻&#10;[03&#58;13&#46;78]&#10;[03&#58;14&#46;57]就算飞蛾扑火&#10;[03&#58;17&#46;87]也勇敢的痛着深深的爱着&#10;[03&#58;24&#46;71]&#10;[03&#58;25&#46;61]就算没有如果&#10;[03&#58;28&#46;42]&#10;[03&#58;29&#46;21]真心无法诉说&#10;[03&#58;32&#46;20]&#10;[03&#58;32&#46;81]那思念也会缀满月色融进泪的温热&#10;[03&#58;39&#46;47]&#10;[03&#58;40&#46;07]哦&#10;[03&#58;42&#46;07]&#10;[03&#58;54&#46;60]心动的那一刻&#10;[03&#58;57&#46;30]&#10;[03&#58;58&#46;21]就算飞蛾扑火&#10;[04&#58;00&#46;95]&#10;[04&#58;01&#46;96]也勇敢的痛着深深的爱着&#10;[04&#58;08&#46;35]&#10;[04&#58;09&#46;11]就算没有如果&#10;[04&#58;12&#46;04]&#10;[04&#58;12&#46;79]真心无法诉说&#10;[04&#58;15&#46;52]&#10;[04&#58;16&#46;37]那思念也会缀满月色融进泪的温热&#10;[04&#58;23&#46;52]爱上你那一刻&#10;[04&#58;26&#46;49]&#10;[04&#58;27&#46;28]也许没有结果&#10;[04&#58;30&#46;47]我也无怨无悔的为你执着","lyric_txt":"                                 就算没有如果      《三生三世十里桃花》电视剧插曲            香香      词：栾杰      曲：谭旋      编曲：可可            与你梦般的邂逅            让我忘了所有      那一刻      你是否也心动            情窦的朦胧            凝结在心魄            轮回中   辗转为你执着            我看见你在等我            流光溢彩的灯火      你笑了            繁华一时无色            你给我的感动延续前世的梦      就算短暂也为你守候            就算没有如果            你会忘记了我            也甘愿被爱蛊惑的热燃烧着的我            就算没有如果            真心无法诉说            那思念也会缀满月色融进泪的温热      爱上你那一刻            也许没有结果            我也无怨无悔的为你执着            我喜欢你好久了            从相遇的那一刻      尘缘中            好想时光停留            那离别的伤痛像箭刺在心口            回忆中泪湿透了清风            就算没有如果            你会忘记了我            也甘愿被爱蛊惑的热燃烧着的我            心动的那一刻            就算飞蛾扑火      也勇敢的痛着深深的爱着            就算没有如果            真心无法诉说            那思念也会缀满月色融进泪的温热            哦            心动的那一刻            就算飞蛾扑火            也勇敢的痛着深深的爱着            就算没有如果            真心无法诉说            那思念也会缀满月色融进泪的温热      爱上你那一刻            也许没有结果      我也无怨无悔的为你执着"}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * ret_code : 0
         * lyric : [ti&#58;就算没有如果&#32;&#40;《三生三世十里桃花》电视剧插曲&#41;]&#10;[ar&#58;香香]&#10;[al&#58;就算没有如果]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;01]就算没有如果&#32;&#40;《三生三世十里桃花》电视剧插曲&#41;&#32;&#45;&#32;香香&#10;[00&#58;01&#46;33]词：栾杰&#10;[00&#58;01&#46;46]曲：谭旋&#10;[00&#58;01&#46;59]编曲：可可&#10;[00&#58;02&#46;44]&#10;[00&#58;31&#46;16]与你梦般的邂逅&#10;[00&#58;33&#46;54]&#10;[00&#58;34&#46;64]让我忘了所有&#10;[00&#58;38&#46;26]那一刻&#10;[00&#58;40&#46;99]你是否也心动&#10;[00&#58;44&#46;15]&#10;[00&#58;45&#46;51]情窦的朦胧&#10;[00&#58;48&#46;24]&#10;[00&#58;48&#46;80]凝结在心魄&#10;[00&#58;52&#46;03]&#10;[00&#58;52&#46;87]轮回中&#32;辗转为你执着&#10;[00&#58;59&#46;23]&#10;[01&#58;00&#46;17]我看见你在等我&#10;[01&#58;03&#46;15]&#10;[01&#58;03&#46;84]流光溢彩的灯火&#10;[01&#58;07&#46;47]你笑了&#10;[01&#58;08&#46;94]&#10;[01&#58;10&#46;02]繁华一时无色&#10;[01&#58;13&#46;97]&#10;[01&#58;14&#46;70]你给我的感动延续前世的梦&#10;[01&#58;21&#46;48]就算短暂也为你守候&#10;[01&#58;27&#46;83]&#10;[01&#58;29&#46;15]就算没有如果&#10;[01&#58;32&#46;22]&#10;[01&#58;32&#46;80]你会忘记了我&#10;[01&#58;35&#46;82]&#10;[01&#58;36&#46;33]也甘愿被爱蛊惑的热燃烧着的我&#10;[01&#58;43&#46;03]&#10;[01&#58;43&#46;63]就算没有如果&#10;[01&#58;46&#46;23]&#10;[01&#58;47&#46;37]真心无法诉说&#10;[01&#58;50&#46;36]&#10;[01&#58;50&#46;96]那思念也会缀满月色融进泪的温热&#10;[01&#58;58&#46;33]爱上你那一刻&#10;[02&#58;00&#46;89]&#10;[02&#58;02&#46;23]也许没有结果&#10;[02&#58;04&#46;44]&#10;[02&#58;04&#46;99]我也无怨无悔的为你执着&#10;[02&#58;16&#46;00]&#10;[02&#58;28&#46;00]我喜欢你好久了&#10;[02&#58;30&#46;00]&#10;[02&#58;31&#46;00]从相遇的那一刻&#10;[02&#58;34&#46;65]尘缘中&#10;[02&#58;36&#46;01]&#10;[02&#58;37&#46;38]好想时光停留&#10;[02&#58;40&#46;49]&#10;[02&#58;41&#46;87]那离别的伤痛像箭刺在心口&#10;[02&#58;47&#46;17]&#10;[02&#58;48&#46;81]回忆中泪湿透了清风&#10;[02&#58;53&#46;99]&#10;[02&#58;56&#46;49]就算没有如果&#10;[02&#58;59&#46;31]&#10;[03&#58;00&#46;09]你会忘记了我&#10;[03&#58;03&#46;04]&#10;[03&#58;03&#46;70]也甘愿被爱蛊惑的热燃烧着的我&#10;[03&#58;10&#46;13]&#10;[03&#58;10&#46;99]心动的那一刻&#10;[03&#58;13&#46;78]&#10;[03&#58;14&#46;57]就算飞蛾扑火&#10;[03&#58;17&#46;87]也勇敢的痛着深深的爱着&#10;[03&#58;24&#46;71]&#10;[03&#58;25&#46;61]就算没有如果&#10;[03&#58;28&#46;42]&#10;[03&#58;29&#46;21]真心无法诉说&#10;[03&#58;32&#46;20]&#10;[03&#58;32&#46;81]那思念也会缀满月色融进泪的温热&#10;[03&#58;39&#46;47]&#10;[03&#58;40&#46;07]哦&#10;[03&#58;42&#46;07]&#10;[03&#58;54&#46;60]心动的那一刻&#10;[03&#58;57&#46;30]&#10;[03&#58;58&#46;21]就算飞蛾扑火&#10;[04&#58;00&#46;95]&#10;[04&#58;01&#46;96]也勇敢的痛着深深的爱着&#10;[04&#58;08&#46;35]&#10;[04&#58;09&#46;11]就算没有如果&#10;[04&#58;12&#46;04]&#10;[04&#58;12&#46;79]真心无法诉说&#10;[04&#58;15&#46;52]&#10;[04&#58;16&#46;37]那思念也会缀满月色融进泪的温热&#10;[04&#58;23&#46;52]爱上你那一刻&#10;[04&#58;26&#46;49]&#10;[04&#58;27&#46;28]也许没有结果&#10;[04&#58;30&#46;47]我也无怨无悔的为你执着
         * lyric_txt :                                  就算没有如果      《三生三世十里桃花》电视剧插曲            香香      词：栾杰      曲：谭旋      编曲：可可            与你梦般的邂逅            让我忘了所有      那一刻      你是否也心动            情窦的朦胧            凝结在心魄            轮回中   辗转为你执着            我看见你在等我            流光溢彩的灯火      你笑了            繁华一时无色            你给我的感动延续前世的梦      就算短暂也为你守候            就算没有如果            你会忘记了我            也甘愿被爱蛊惑的热燃烧着的我            就算没有如果            真心无法诉说            那思念也会缀满月色融进泪的温热      爱上你那一刻            也许没有结果            我也无怨无悔的为你执着            我喜欢你好久了            从相遇的那一刻      尘缘中            好想时光停留            那离别的伤痛像箭刺在心口            回忆中泪湿透了清风            就算没有如果            你会忘记了我            也甘愿被爱蛊惑的热燃烧着的我            心动的那一刻            就算飞蛾扑火      也勇敢的痛着深深的爱着            就算没有如果            真心无法诉说            那思念也会缀满月色融进泪的温热            哦            心动的那一刻            就算飞蛾扑火            也勇敢的痛着深深的爱着            就算没有如果            真心无法诉说            那思念也会缀满月色融进泪的温热      爱上你那一刻            也许没有结果      我也无怨无悔的为你执着
         */

        private int ret_code;
        private String lyric;
        private String lyric_txt;

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public String getLyric() {
            return lyric;
        }

        public void setLyric(String lyric) {
            this.lyric = lyric;
        }

        public String getLyric_txt() {
            return lyric_txt;
        }

        public void setLyric_txt(String lyric_txt) {
            this.lyric_txt = lyric_txt;
        }
    }
}

